---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersection.GetEnumerator
source: html/1c4ae401-06e8-e1e0-281a-2ba9a297949f.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Curve> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.